/* 
    조건문 : 조건 문법
        - 조건의 결과값 : true / false 
        - 삼항연산자 : 간단한 조건문
        1. IF 조건문 : 조건문을 표현 가능한 문법
            - 조건에 True/False, 비교연산 또는 관계연산
        2. IF 형태
            1. if(조건) 참일 경우 코드;
            2. if(조건) {참일 경우 코드; 참일 경우 코드;}
            3. if(조건) {참일 경우 코드; }
                else {거짓일 경우 코드; }
            4. if(조건1) {조건 1이 참일 경우 코드; }
                else if(조건2) {조건 2가 참일 경우 코드; }
                else if(조건3) {조건 3이 참일 경우 코드; }
                else if(조건4) {조건 4가 참일 경우 코드; }
                else {거짓일 경우 코드; }
            5. if 중첩
            if(조건) {
                if(조건){
                    if(조건){
                        else{ }
                        }
                else{ }        
                    }    
                else{ }
                }     
    - 주의할 점 : if(조건) {} 사이에 ;은 없이 작성, {시작중괄호 }끝중괄호 매칭          
*/